booking-parent/booking-adapter-soap/src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://vavatech.pl/">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:booking>
            <firstName>Jan</firstName>
            <lastName>Kowalski</lastName>
        </soap:booking>
    </soapenv:Body>
</soapenv:Envelope>